package kr.ac.kopo.day17;

import java.io.DataInputStream;
import java.io.InputStream;
import java.net.Socket;

public class AppClientMain {

	public static void main(String[] args) {
		
		// 상대 포트가 안 열려있을 수도 있기 때문에 checked exception이다.
		try {
			System.out.println("서버와의 접속을 시도합니다");
			Socket socket = new Socket("169.254.73.113", 10000); // 외부에서 접속할 수 있도록 하려면 실제 ip주소를 알아야 한다. >> 학교컴 172.16.88.137
			
			System.out.println("socket port : " + socket.getLocalPort());
			
			InputStream is = socket.getInputStream();
			DataInputStream dis = new DataInputStream(is);
			
			String msg = dis.readUTF();
			
		} catch (Exception e) {
			e.printStackTrace();
		}
	}	
}

/*
						  전혜원바보바보바보																보전혜원바보바보바
				전혜원바보바보바보바보바보전혜원바보바보										바보바보바보전혜원바보바보바보바보바보
				전혜원바보바보바보바보바보전혜원바보바보										바보바보바보전혜원바보바보바보바보바보
				전혜원바보바보바보바보바보전혜원바보바보										바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원					바보전혜원바보바보바보바보바보전혜원바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바			바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보
		   		전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원
		   				전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바
		   						전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원
		   									전혜원바보바보바보바보바보전혜원바보바보바보바보바보전혜원바보바
		   												전혜원바보바보바보바보바보전혜원바보바보
		   																보바보전혜원바보
		   																	전혜원바보
*/